![BTS](https://github.com/vfp1/bts-mbds-data-science-foundations-2019/blob/master/sessions/img/Logo-BTS.jpg?raw=1)

# Session 4: Pandas and SQLite in depth session

### Victor F. Pajuelo Madrigal <victor.pajuelo@bts.tech> - Data Science Foundations (2019-10-10)

Open this notebook in Google Colaboratory: [![Open in Colab](https://colab.research.google.com/assets/colab-badge.svg)](https://colab.research.google.com/github/vfp1/bts-mbds-data-science-foundations-2019/blob/master/sessions/04_Pandas_&_SQLite_recap_through_exercises.ipynb)

# OPTIONAL assignements from WEEK one

Let's look in depth at the optional assignements from WEEK 1

You can find the first week exercise notebook by opening this notebook in Google Colaboratory: 
[![Open in Colab](https://colab.research.google.com/assets/colab-badge.svg)](https://colab.research.google.com/github/vfp1/bts-mbds-data-science-foundations-2019/blob/master/sessions/DSF_WEEK_1_EXERCISES.ipynb)

# More Pandas!

Check a good cheatsheet for Pandas [here](https://www.w3resource.com/python-exercises/pandas/index.php)

[Some cool exercise resources for Pandas](https://www.machinelearningplus.com/python/101-pandas-exercises-python/)

## Groupby exersises

Import this [dataset](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user)

*   What is the mean age per occupation?
*   What is the male ratio per occupation, sort it from the most to the least. Do the same for women
*   For each occupation, calculate the minimum and maximum ages
* For each combination of occupation and gender, calculate the mean age
* For each occupation present the percentage of women and men

In [2]:
import pandas as pd

url = "https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user"

workers = pd.read_table(url, 
                      sep='|', index_col='user_id')
workers.head()

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:6: FutureWarning: read_table is deprecated, use read_csv instead.

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

## What is the mean age per occupation?

In [0]:
workers.groupby('occupation').age.mean()

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

## Male ratio per occupation
Sort it from the most to the list

In [0]:
"""
We create a function to apply it and create a new column. We will call it gender number.
This function returns values of 1 to count the gender that we are interested in
"""
# create a function
def gender_to_numeric(x):
    if x == 'M':
        return 1
    if x == 'F':
        return 0

# apply the function to the gender column and create a new column
workers['gender_n'] = workers['gender'].apply(gender_to_numeric)
workers.head(10)

         age gender     occupation zip_code  gender_n
user_id
1         24      M     technician    85711         1
2         53      F          other    94043         0
3         23      M         writer    32067         1
4         24      M     technician    43537         1
5         33      F          other    15213         0
6         42      M      executive    98101         1
7         57      M  administrator    91344         1
8         36      M  administrator    05201         1
9         29      M        student    01002         1
10        53      M         lawyer    90703         1

In [0]:
a = workers.groupby('occupation').gender_n.sum() / workers.occupation.value_counts() * 100 

# sort to the most male 
a.sort_values(ascending = False)

doctor           100.000000
engineer          97.014925
technician        96.296296
retired           92.857143
programmer        90.909091
executive         90.625000
scientist         90.322581
entertainment     88.888889
lawyer            83.333333
salesman          75.000000
educator          72.631579
student           69.387755
other             65.714286
marketing         61.538462
writer            57.777778
none              55.555556
administrator     54.430380
artist            53.571429
librarian         43.137255
healthcare        31.250000
homemaker         14.285714
dtype: float64

# Female ratio per occupation
Sort it from the most to the least

In [0]:
"""
We create a function to apply it and create a new column. We will call it gender number.
This function returns values of 1 to count the gender that we are interested in
"""
def gender_to_numeric(x):
    if x == 'M':
        return 0
    if x == 'F':
        return 1

# apply the function to the gender column and create a new column
workers['gender_n'] = workers['gender'].apply(gender_to_numeric)
workers.head(10)

         age gender     occupation zip_code  gender_n
user_id
1         24      M     technician    85711         0
2         53      F          other    94043         1
3         23      M         writer    32067         0
4         24      M     technician    43537         0
5         33      F          other    15213         1
6         42      M      executive    98101         0
7         57      M  administrator    91344         0
8         36      M  administrator    05201         0
9         29      M        student    01002         0
10        53      M         lawyer    90703         0

In [0]:
a = workers.groupby('occupation').gender_n.sum() / workers.occupation.value_counts() * 100 

# sort to the most male 
a.sort_values(ascending = False)

homemaker        85.714286
healthcare       68.750000
librarian        56.862745
artist           46.428571
administrator    45.569620
none             44.444444
writer           42.222222
marketing        38.461538
other            34.285714
student          30.612245
educator         27.368421
salesman         25.000000
lawyer           16.666667
entertainment    11.111111
scientist         9.677419
executive         9.375000
programmer        9.090909
retired           7.142857
technician        3.703704
engineer          2.985075
doctor            0.000000
dtype: float64

In [7]:
# Alejandra's beautiful code - 

# USE NORMALIZE FOR PERCENTAGE
import pandas as pd

url = "https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user"

workers = pd.read_table(url, 
                      sep='|')
workers.head()


male_female= workers.groupby(by=['occupation', 'gender']).count()

male_female.drop('age', axis =1)

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:6: FutureWarning: read_table is deprecated, use read_csv instead.

                      user_id  zip_code
occupation    gender
administrator F            36        36
              M            43        43
artist        F            13        13
              M            15        15
doctor        M             7         7
educator      F            26        26
              M            69        69
engineer      F             2         2
              M            65        65
entertainment F             2         2
              M            16        16
executive     F             3         3
              M            29        29
healthcare    F            11        11
              M             5         5
homemaker     F             6         6
              M             1         1
lawyer        F             2         2
              M            10        10
librarian     F            29        29
              M            22        22
marketing     F            10        10
              M            16        16
none          F             4         4
              M             5         5
other         F            36        36
              M            69        69
programmer    F             6         6
              M            60        60
retired       F             1         1
              M            13        13
salesman      F             3         3
              M             9         9
scientist     F             3         3
              M            28        28
student       F            60        60
              M           136       136
technician    F             1         1
              M            26        26
writer        F            19        19
              M            26        26

## Calculate the minimum and maximum ages for each occupation

In [0]:
workers.groupby('occupation').age.agg(['min', 'max'])

               min  max
occupation
administrator   21   70
artist          19   48
doctor          28   64
educator        23   63
engineer        22   70
entertainment   15   50
executive       22   69
healthcare      22   62
homemaker       20   50
lawyer          21   53
librarian       23   69
marketing       24   55
none            11   55
other           13   64
programmer      20   63
retired         51   73
salesman        18   66
scientist       23   55
student          7   42
technician      21   55
writer          18   60

## For each combination of occupation and gender, calculate the mean age

In [0]:
workers.groupby(['occupation', 'gender']).age.mean()

occupation     gender
administrator  F         40.638889
               M         37.162791
artist         F         30.307692
               M         32.333333
doctor         M         43.571429
educator       F         39.115385
               M         43.101449
engineer       F         29.500000
               M         36.600000
entertainment  F         31.000000
               M         29.000000
executive      F         44.000000
               M         38.172414
healthcare     F         39.818182
               M         45.400000
homemaker      F         34.166667
               M         23.000000
lawyer         F         39.500000
               M         36.200000
librarian      F         40.000000
               M         40.000000
marketing      F         37.200000
               M         37.875000
none           F         36.500000
               M         18.600000
other          F         35.472222
               M         34.028986
programmer     F         32.166667
               M         33.216667
retired        F         70.000000
               M         62.538462
salesman       F         27.000000
               M         38.555556
scientist      F         28.333333
               M         36.321429
student        F         20.750000
               M         22.669118
technician     F         38.000000
               M         32.961538
writer         F         37.631579
               M         35.346154
Name: age, dtype: float64

## For each occupation present the percentage of women and men

In [0]:
# create a data frame and apply count to gender
gender_ocup = workers.groupby(['occupation', 'gender']).agg({'gender': 'count'})
gender_ocup.head(10)

                      gender
occupation    gender
administrator F           36
              M           43
artist        F           13
              M           15
doctor        M            7
educator      F           26
              M           69
engineer      F            2
              M           65
entertainment F            2

In [0]:
# create a DataFrame and apply count for each occupation
occup_count = workers.groupby(['occupation']).agg('count')
occup_count.head(10)

               age  gender  zip_code  gender_n
occupation
administrator   79      79        79        79
artist          28      28        28        28
doctor           7       7         7         7
educator        95      95        95        95
engineer        67      67        67        67
entertainment   18      18        18        18
executive       32      32        32        32
healthcare      16      16        16        16
homemaker        7       7         7         7
lawyer          12      12        12        12

In [0]:
# divide the gender_ocup per the occup_count and multiply per 100
occup_gender = gender_ocup.div(occup_count, level = "occupation") * 100
occup_gender.head(10)

                      age      gender  gender_n  zip_code
occupation    gender
administrator F       NaN   45.569620       NaN       NaN
              M       NaN   54.430380       NaN       NaN
artist        F       NaN   46.428571       NaN       NaN
              M       NaN   53.571429       NaN       NaN
doctor        M       NaN  100.000000       NaN       NaN
educator      F       NaN   27.368421       NaN       NaN
              M       NaN   72.631579       NaN       NaN
engineer      F       NaN    2.985075       NaN       NaN
              M       NaN   97.014925       NaN       NaN
entertainment F       NaN   11.111111       NaN       NaN

In [0]:
# present all rows from the 'gender column'
occup_gender.loc[: , 'gender']

occupation     gender
administrator  F          45.569620
               M          54.430380
artist         F          46.428571
               M          53.571429
doctor         M         100.000000
educator       F          27.368421
               M          72.631579
engineer       F           2.985075
               M          97.014925
entertainment  F          11.111111
               M          88.888889
executive      F           9.375000
               M          90.625000
healthcare     F          68.750000
               M          31.250000
homemaker      F          85.714286
               M          14.285714
lawyer         F          16.666667
               M          83.333333
librarian      F          56.862745
               M          43.137255
marketing      F          38.461538
               M          61.538462
none           F          44.444444
               M          55.555556
other          F          34.285714
               M          65.714286
programmer     F           9.090909
               M          90.909091
retired        F           7.142857
               M          92.857143
salesman       F          25.000000
               M          75.000000
scientist      F           9.677419
               M          90.322581
student        F          30.612245
               M          69.387755
technician     F           3.703704
               M          96.296296
writer         F          42.222222
               M          57.777778
Name: gender, dtype: float64

## Apply exercises

Import this [dataset](https://github.com/vfp1/bts-mbds-data-science-foundations-2019/raw/master/sessions/data/US_Crime_Rates_1960_2014.csv)

* What is the type of the columns?
* Convert the type of the column Year to datetime64
* Set the Year column as the index of the dataframe
* Delete the Total column
* Group the year by decades and sum the values (take care with population values)
* What is the most dangerous decade to live in the US?

In [0]:
import pandas as pd
import numpy as np

url = "https://github.com/vfp1/bts-mbds-data-science-foundations-2019/raw/master/sessions/data/US_Crime_Rates_1960_2014.csv"

crime = pd.read_csv(url)
crime.head()

   Year  Population    Total  ...  Burglary  Larceny_Theft  Vehicle_Theft
0  1960   179323175  3384200  ...    912100        1855400         328200
1  1961   182992000  3488000  ...    949600        1913000         336000
2  1962   185771000  3752200  ...    994300        2089600         366800
3  1963   188483000  4109500  ...   1086400        2297800         408300
4  1964   191141000  4564600  ...   1213200        2514400         472800

[5 rows x 12 columns]

## What is the type of the columns

In [0]:
crime.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 55 entries, 0 to 54
Data columns (total 12 columns):
Year                  55 non-null int64
Population            55 non-null int64
Total                 55 non-null int64
Violent               55 non-null int64
Property              55 non-null int64
Murder                55 non-null int64
Forcible_Rape         55 non-null int64
Robbery               55 non-null int64
Aggravated_assault    55 non-null int64
Burglary              55 non-null int64
Larceny_Theft         55 non-null int64
Vehicle_Theft         55 non-null int64
dtypes: int64(12)
memory usage: 5.2 KB

If we did not import the dataset with the right timestamp, we will need to treat the datetimes accordingly

In [0]:
crime.Year = pd.to_datetime(crime.Year, format='%Y')
crime.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 55 entries, 0 to 54
Data columns (total 12 columns):
Year                  55 non-null datetime64[ns]
Population            55 non-null int64
Total                 55 non-null int64
Violent               55 non-null int64
Property              55 non-null int64
Murder                55 non-null int64
Forcible_Rape         55 non-null int64
Robbery               55 non-null int64
Aggravated_assault    55 non-null int64
Burglary              55 non-null int64
Larceny_Theft         55 non-null int64
Vehicle_Theft         55 non-null int64
dtypes: datetime64[ns](1), int64(11)
memory usage: 5.2 KB

## Set the year column as the index of the dataframe

In [0]:
crime = crime.set_index('Year', drop = True)
crime.head()

            Population    Total  ...  Larceny_Theft  Vehicle_Theft
Year                             ...
1960-01-01   179323175  3384200  ...        1855400         328200
1961-01-01   182992000  3488000  ...        1913000         336000
1962-01-01   185771000  3752200  ...        2089600         366800
1963-01-01   188483000  4109500  ...        2297800         408300
1964-01-01   191141000  4564600  ...        2514400         472800

[5 rows x 11 columns]

## Delete the Total column

In [0]:
del crime['Total']
crime.head()

            Population  Violent  ...  Larceny_Theft  Vehicle_Theft
Year                             ...
1960-01-01   179323175   288460  ...        1855400         328200
1961-01-01   182992000   289390  ...        1913000         336000
1962-01-01   185771000   301510  ...        2089600         366800
1963-01-01   188483000   316970  ...        2297800         408300
1964-01-01   191141000   364220  ...        2514400         472800

[5 rows x 10 columns]

## Group by year, by decades and sum the values

Take care with population column

In [0]:
# To learn more about .resample (https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.resample.html)
# To learn more about Offset Aliases (http://pandas.pydata.org/pandas-docs/stable/timeseries.html#offset-aliases)

# Uses resample to sum each decade
crimes = crime.resample('10AS').sum()
crimes.head(10)

            Population   Violent  ...  Larceny_Theft  Vehicle_Theft
Year                              ...
1960-01-01  1915053175   4134930  ...       26547700        5292100
1970-01-01  2121193298   9607930  ...       53157800        9739900
1980-01-01  2371370069  14074328  ...       72040253       11935411
1990-01-01  2612825258  17527048  ...       77679366       14624418
2000-01-01  2947969117  13968056  ...       67970291       11412834
2010-01-01  1570146307   6072017  ...       30401698        3569080

[6 rows x 10 columns]

In [0]:
# Uses resample to get the max value only for the "Population" column
population = crime['Population'].resample('10AS').max()
population.head(5)

Year
1960-01-01    201385000
1970-01-01    220099000
1980-01-01    248239000
1990-01-01    272690813
2000-01-01    307006550
Freq: 10AS-JAN, Name: Population, dtype: int64

In [0]:
# Updating the "Population" column
crimes['Population'] = population

crimes.head()

            Population   Violent  ...  Larceny_Theft  Vehicle_Theft
Year                              ...
1960-01-01   201385000   4134930  ...       26547700        5292100
1970-01-01   220099000   9607930  ...       53157800        9739900
1980-01-01   248239000  14074328  ...       72040253       11935411
1990-01-01   272690813  17527048  ...       77679366       14624418
2000-01-01   307006550  13968056  ...       67970291       11412834

[5 rows x 10 columns]

## What is the most dangerous decade to live in the US?

In [0]:
crime.idxmax(0)

Population           2014-01-01
Violent              1992-01-01
Property             1991-01-01
Murder               1991-01-01
Forcible_Rape        1992-01-01
Robbery              1991-01-01
Aggravated_assault   1993-01-01
Burglary             1980-01-01
Larceny_Theft        1991-01-01
Vehicle_Theft        1991-01-01
dtype: datetime64[ns]

# SQLite and Pandas

## SQLite, Pandas and the world of tips

Given [this](https://raw.github.com/pandas-dev/pandas/master/pandas/tests/data/tips.csv) CSV file. Do the following:

* Load it in Pandas
* Save the `DataFrame` as SQLite
* Reply the following questions by slicing the SQLite database with SQL queries and then using Pandas for analysis:
    * Who is most likely to receive a tip during weekday? A Female or a Male? 
        * And during weekends?
    * What is the table size that is most likely to bring a better tip?
    * Who are giving more tips, smokers or non smokers?

In [8]:
import pandas as pd
import numpy as np

url = 'https://raw.github.com/pandas-dev/pandas/master/pandas/tests/data/tips.csv'

tips = pd.read_csv(url)
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

## Save the DataFrame as SQLite

In [0]:
import sqlite3

cnx = sqlite3.connect('tips.db')
tips.to_sql(name='tips', con=cnx)

## Setting util functions

In [0]:
import sqlite3

def create_connect_database(db_name):
    """Opens connection or creates it if it is not existent"""
    connection = sqlite3.connect(db_name)
    cursor = connection.cursor()
    
    return connection, cursor

def commit_close(conn, c, close_connection=True):
    """Commits to connection DB and closes it if close is True"""
    conn.commit()

    if close_connection is True:
        c.close()
        conn.close()
    elif close_connection is False:
        pass

## Who is most likely to receive a tip during weekday? A Female or a Male?
And during weekends?

In [11]:
import pandas as pd
import sqlite3

conn, cursor = create_connect_database("tips.db")

query = """SELECT day, sex, COUNT(*)
FROM tips
GROUP BY day, sex;"""

df = pd.read_sql_query(query, conn)
df

    day     sex  COUNT(*)
0   Fri  Female         9
1   Fri    Male        10
2   Sat  Female        28
3   Sat    Male        59
4   Sun  Female        18
5   Sun    Male        58
6  Thur  Female        32
7  Thur    Male        30

In [14]:
# Giuseppe super advanced SQL

query = '''SELECT  

                sex 

                ,CASE 

                    WHEN (day != 'Sat') and (day != 'Sun') THEN 'weekday' 

                    ELSE 'weekend' 

                END AS weekday_weekend 

                ,count(tip) 

  

FROM tips 

GROUP BY sex 

                ,CASE 

                    WHEN (day != 'Sat') and (day != 'Sun') THEN 'weekday' 

                    ELSE 'weekend' 

                END 

''' 
df = pd.read_sql_query(query, conn)
df

      sex weekday_weekend  count(tip)
0  Female         weekday          41
1  Female         weekend          46
2    Male         weekday          40
3    Male         weekend         117

## What is the table size that is most likely to bring a better tip?

In [0]:
import pandas as pd
import sqlite3

conn, cursor = create_connect_database("tips.db")

query = """SELECT size, AVG(tip), COUNT(*)
FROM tips
GROUP BY size;"""

df = pd.read_sql_query(query, conn)
df

   size  AVG(tip)  COUNT(*)
0     1  1.437500         4
1     2  2.582308       156
2     3  3.393158        38
3     4  4.135405        37
4     5  4.028000         5
5     6  5.225000         4

## Who are giving more tips, smokers or non smokers?

In [0]:
import pandas as pd
import sqlite3

conn, cursor = create_connect_database("tips.db")

query = """SELECT smoker, AVG(tip), COUNT(*)
FROM tips
GROUP BY smoker;"""

df = pd.read_sql_query(query, conn)
df

  smoker  AVG(tip)  COUNT(*)
0     No  2.991854       151
1    Yes  3.008710        93

## More airports, this time without spatial fears

Download [this Sqlite database](https://github.com/vfp1/bts-mbds-data-science-foundations-2019/raw/master/sessions/data/flights.db)

Using SQLite database reply the following questions:

*   Which is the country that has the least amount of active airlines?
*   And which is the country that has the most amount of active airlines?
*   Which is the country that has more airports?
*   And the country with the least airports?
*   Which country has the most outgoing destinations? And the least?
*   And which country has the most incoming destinations? And the least?

## Setting util functions

In [0]:
import sqlite3

def create_connect_database(db_name):
    """Opens connection or creates it if it is not existent"""
    connection = sqlite3.connect(db_name)
    cursor = connection.cursor()
    
    return connection, cursor

def commit_close(conn, c, close_connection=True):
    """Commits to connection DB and closes it if close is True"""
    conn.commit()

    if close_connection is True:
        c.close()
        conn.close()
    elif close_connection is False:
        pass

## Download and load data

In [15]:
!wget "https://github.com/vfp1/bts-mbds-data-science-foundations-2019/raw/master/sessions/data/flights.db"

--2019-10-11 10:39:43--  https://github.com/vfp1/bts-mbds-data-science-foundations-2019/raw/master/sessions/data/flights.db
Resolving github.com (github.com)... 192.30.253.113
Connecting to github.com (github.com)|192.30.253.113|:443... connected.
HTTP request sent, awaiting response... 302 Found
Location: https://raw.githubusercontent.com/vfp1/bts-mbds-data-science-foundations-2019/master/sessions/data/flights.db [following]
--2019-10-11 10:39:43--  https://raw.githubusercontent.com/vfp1/bts-mbds-data-science-foundations-2019/master/sessions/data/flights.db
Resolving raw.githubusercontent.com (raw.githubusercontent.com)... 151.101.0.133, 151.101.64.133, 151.101.128.133, ...
Connecting to raw.githubusercontent.com (raw.githubusercontent.com)|151.101.0.133|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 5415936 (5.2M) [application/octet-stream]
Saving to: ‘flights.db’

flights.db          100%[===================>]   5.17M  --.-KB/s    in 0.1s

2019-10-11 10:39:43 (47.3 MB/s) - ‘flights.db’ saved [5415936/5415936]

In [16]:
import sqlite3

connection, cursor = create_connect_database('flights.db')

cursor.execute("SELECT name FROM SQLite_master WHERE type='table';")
tables = cursor.fetchall()
print(tables)

[('airports',), ('airlines',), ('routes',)]

## Which is the country that has the least amount of active airlines?

In [17]:
import pandas as pd
import sqlite3

conn, cursor = create_connect_database("flights.db")

query = """SELECT country FROM airlines WHERE active=='Y';"""

df = pd.read_sql_query(query, conn)
df.head(5)

         country
0           None
1   South Africa
2  United States
3      Australia
4      Singapore

In [18]:
df['country'].value_counts().sort_values(ascending=True)

Kiribati                                   1
Turkmenistan                               1
Faroe Islands                              1
Guatemala                                  1
Syrian Arab Republic                       1
Vanuatu                                    1
Lao Peoples Democratic Republic            1
Niger                                      1
Solomon Islands                            1
Benin                                      1
Montenegro                                 1
Antigua and Barbuda                        1
Senegal                                    1
ALASKA                                     1
AVIANCA                                    1
Palau                                      1
Burkina Faso                               1
Trinidad and Tobago                        1
Equatorial Guinea                          1
Luxembourg                                 1
Democratic People's Republic of Korea      1
Namibia                                    1
Togo                                       1
Madagascar                                 1
Rwanda                                     1
Sao Tome and Principe                      1
Saint Vincent and the Grenadines           1
Suriname                                   1
Aruba                                      1
Botswana                                   1
                                        ...
Iceland                                    9
Colombia                                   9
Argentina                                 10
Greece                                    10
South Africa                              10
Peru                                      11
Egypt                                     12
Finland                                   12
Austria                                   12
Mexico                                    12
Portugal                                  13
Ukraine                                   13
Switzerland                               14
Sweden                                    15
Thailand                                  16
Turkey                                    16
India                                     17
Indonesia                                 17
Italy                                     18
Japan                                     19
France                                    22
Brazil                                    23
Spain                                     24
China                                     25
Australia                                 26
Canada                                    34
Germany                                   37
United Kingdom                            40
Russia                                    72
United States                            141
Name: country, Length: 194, dtype: int64

## And which is the country that has the most amount of active airlines?

In [19]:
df['country'].value_counts().sort_values(ascending=False)

United States                            141
Russia                                    72
United Kingdom                            40
Germany                                   37
Canada                                    34
Australia                                 26
China                                     25
Spain                                     24
Brazil                                    23
France                                    22
Japan                                     19
Italy                                     18
Indonesia                                 17
India                                     17
Turkey                                    16
Thailand                                  16
Sweden                                    15
Switzerland                               14
Ukraine                                   13
Portugal                                  13
Mexico                                    12
Austria                                   12
Finland                                   12
Egypt                                     12
Peru                                      11
South Africa                              10
Greece                                    10
Argentina                                 10
Colombia                                   9
Iceland                                    9
                                        ...
Botswana                                   1
Aruba                                      1
Suriname                                   1
Saint Vincent and the Grenadines           1
Sao Tome and Principe                      1
Rwanda                                     1
Madagascar                                 1
Togo                                       1
Namibia                                    1
Democratic People's Republic of Korea      1
Luxembourg                                 1
Equatorial Guinea                          1
Trinidad and Tobago                        1
Burkina Faso                               1
Palau                                      1
AVIANCA                                    1
ALASKA                                     1
Senegal                                    1
Antigua and Barbuda                        1
Montenegro                                 1
Benin                                      1
Solomon Islands                            1
Niger                                      1
Lao Peoples Democratic Republic            1
Vanuatu                                    1
Syrian Arab Republic                       1
Guatemala                                  1
Faroe Islands                              1
Turkmenistan                               1
Kiribati                                   1
Name: country, Length: 194, dtype: int64

## Which is the country that has more airports?

In [0]:
# Another of Giuseppe's pearls
"""SELECT country, COUNT(name) FROM airports GROUP BY country;"""

In [20]:
import pandas as pd
import sqlite3

conn, cursor = create_connect_database("flights.db")

query = """SELECT country FROM airports;"""

df = pd.read_sql_query(query, conn)
df.head(5)

            country
0  Papua New Guinea
1  Papua New Guinea
2  Papua New Guinea
3  Papua New Guinea
4  Papua New Guinea

In [0]:
df['country'].value_counts().sort_values(ascending=False)

United States                     1697
Canada                             435
Germany                            321
Australia                          263
Russia                             249
France                             233
China                              219
Brazil                             213
United Kingdom                     210
India                              140
Japan                              131
Indonesia                          114
South Africa                       103
Argentina                          103
Mexico                              94
Italy                               92
Sweden                              86
Spain                               84
Iran                                81
Turkey                              77
Colombia                            72
Norway                              69
Philippines                         64
Greece                              60
Venezuela                           58
Thailand                            58
Papua New Guinea                    57
New Zealand                         56
Kenya                               55
Switzerland                         53
                                  ...
Christmas Island                     1
Myanmar                              1
Monaco                               1
Barbados                             1
Gambia                               1
Benin                                1
Luxembourg                           1
Isle of Man                          1
Gibraltar                            1
West Bank                            1
Bhutan                               1
Saint Helena                         1
Tuvalu                               1
Swaziland                            1
Anguilla                             1
Aruba                                1
Midway Islands                       1
Korea                                1
Johnston Atoll                       1
Nauru                                1
Palestine                            1
Niue                                 1
Cocos (Keeling) Islands              1
Norfolk Island                       1
Albania                              1
Jersey                               1
Wake Island                          1
Burundi                              1
British Indian Ocean Territory       1
Mayotte                              1
Name: country, Length: 240, dtype: int64

## And the country with the least airports?

In [0]:
df['country'].value_counts().sort_values(ascending=True)

Mayotte                              1
British Indian Ocean Territory       1
Burundi                              1
Wake Island                          1
Jersey                               1
Albania                              1
Norfolk Island                       1
Cocos (Keeling) Islands              1
Niue                                 1
Palestine                            1
Nauru                                1
Johnston Atoll                       1
Korea                                1
Midway Islands                       1
Aruba                                1
Anguilla                             1
Swaziland                            1
Tuvalu                               1
Saint Helena                         1
Bhutan                               1
West Bank                            1
Gibraltar                            1
Isle of Man                          1
Luxembourg                           1
Benin                                1
Gambia                               1
Barbados                             1
Monaco                               1
Myanmar                              1
Christmas Island                     1
                                  ...
Switzerland                         53
Kenya                               55
New Zealand                         56
Papua New Guinea                    57
Thailand                            58
Venezuela                           58
Greece                              60
Philippines                         64
Norway                              69
Colombia                            72
Turkey                              77
Iran                                81
Spain                               84
Sweden                              86
Italy                               92
Mexico                              94
Argentina                          103
South Africa                       103
Indonesia                          114
Japan                              131
India                              140
United Kingdom                     210
Brazil                             213
China                              219
France                             233
Russia                             249
Australia                          263
Germany                            321
Canada                             435
United States                     1697
Name: country, Length: 240, dtype: int64

## Which country has the most outgoing destinations? And the least?

In [0]:
import pandas as pd
import sqlite3

conn, cursor = create_connect_database("flights.db")

query = """SELECT 
CAST(source_air.country AS TEXT) AS source_country, 
CAST(destination_air.country AS TEXT) AS destination_country 
FROM routes 
INNER JOIN airports source_air 
  ON source_air.id = routes.source_id 
INNER JOIN airports destination_air 
  ON destination_air.id = routes.dest_id;"""

df = pd.read_sql_query(query, conn)
df.head(5)

  source_country destination_country
0         Russia              Russia
1         Russia              Russia
2         Russia              Russia
3         Russia              Russia
4         Russia              Russia

In [0]:
df['source_country'].value_counts().sort_values(ascending=False)

United States                       13178
China                                8146
United Kingdom                       2661
Spain                                2530
Germany                              2353
France                               1844
Canada                               1835
Russia                               1810
Italy                                1776
India                                1506
Brazil                               1389
Japan                                1294
Australia                            1108
Mexico                               1059
Turkey                                974
Indonesia                             827
Greece                                787
United Arab Emirates                  751
Norway                                648
Thailand                              605
South Korea                           589
Netherlands                           570
Malaysia                              567
Saudi Arabia                          548
Portugal                              530
Switzerland                           524
Sweden                                472
Iran                                  425
Taiwan                                414
Belgium                               412
                                    ...
Eritrea                                 8
Marshall Islands                        7
French Guiana                           7
Guinea-Bissau                           7
Western Sahara                          7
Kiribati                                7
Gibraltar                               6
Anguilla                                6
Korea                                   5
Samoa                                   5
Tonga                                   5
Bhutan                                  5
Saint Vincent and the Grenadines        4
Faroe Islands                           4
East Timor                              4
Wallis and Futuna                       4
Norfolk Island                          3
Sao Tome and Principe                   3
Nauru                                   3
Central African Republic                3
Saint Pierre and Miquelon               3
Christmas Island                        2
Monaco                                  1
American Samoa                          1
Lesotho                                 1
Tuvalu                                  1
Cocos (Keeling) Islands                 1
Falkland Islands                        1
Swaziland                               1
Niue                                    1
Name: source_country, Length: 226, dtype: int64

In [0]:
df['source_country'].value_counts().sort_values(ascending=True)

Niue                                    1
Swaziland                               1
Falkland Islands                        1
Cocos (Keeling) Islands                 1
Tuvalu                                  1
Lesotho                                 1
American Samoa                          1
Monaco                                  1
Christmas Island                        2
Saint Pierre and Miquelon               3
Central African Republic                3
Nauru                                   3
Sao Tome and Principe                   3
Norfolk Island                          3
Wallis and Futuna                       4
East Timor                              4
Faroe Islands                           4
Saint Vincent and the Grenadines        4
Bhutan                                  5
Tonga                                   5
Samoa                                   5
Korea                                   5
Anguilla                                6
Gibraltar                               6
Kiribati                                7
Western Sahara                          7
Guinea-Bissau                           7
French Guiana                           7
Marshall Islands                        7
Eritrea                                 8
                                    ...
Belgium                               412
Taiwan                                414
Iran                                  425
Sweden                                472
Switzerland                           524
Portugal                              530
Saudi Arabia                          548
Malaysia                              567
Netherlands                           570
South Korea                           589
Thailand                              605
Norway                                648
United Arab Emirates                  751
Greece                                787
Indonesia                             827
Turkey                                974
Mexico                               1059
Australia                            1108
Japan                                1294
Brazil                               1389
India                                1506
Italy                                1776
Russia                               1810
Canada                               1835
France                               1844
Germany                              2353
Spain                                2530
United Kingdom                       2661
China                                8146
United States                       13178
Name: source_country, Length: 226, dtype: int64

## And which country has the most incoming destinations? And the least?

In [0]:
df['destination_country'].value_counts().sort_values(ascending=False)

United States                       13173
China                                8146
United Kingdom                       2635
Spain                                2533
Germany                              2337
Canada                               1844
France                               1842
Russia                               1817
Italy                                1779
India                                1503
Brazil                               1386
Japan                                1299
Australia                            1092
Mexico                               1053
Turkey                                983
Indonesia                             825
Greece                                814
United Arab Emirates                  741
Norway                                648
Thailand                              604
South Korea                           589
Malaysia                              567
Netherlands                           566
Saudi Arabia                          560
Portugal                              541
Switzerland                           520
Sweden                                474
Iran                                  427
Taiwan                                412
Singapore                             412
                                    ...
Palau                                   9
Eritrea                                 8
French Guiana                           7
Kiribati                                7
Marshall Islands                        7
Western Sahara                          7
Guinea-Bissau                           7
Anguilla                                6
Gibraltar                               6
Samoa                                   6
Saint Vincent and the Grenadines        5
Bhutan                                  5
Korea                                   5
Tonga                                   5
East Timor                              4
Faroe Islands                           4
Wallis and Futuna                       4
Sao Tome and Principe                   4
Central African Republic                3
Nauru                                   3
Saint Pierre and Miquelon               3
Christmas Island                        2
Norfolk Island                          2
Cocos (Keeling) Islands                 1
Lesotho                                 1
Swaziland                               1
Falkland Islands                        1
Monaco                                  1
Tuvalu                                  1
American Samoa                          1
Name: destination_country, Length: 225, dtype: int64

In [0]:
df['destination_country'].value_counts().sort_values(ascending=True)

American Samoa                          1
Tuvalu                                  1
Monaco                                  1
Falkland Islands                        1
Swaziland                               1
Lesotho                                 1
Cocos (Keeling) Islands                 1
Norfolk Island                          2
Christmas Island                        2
Saint Pierre and Miquelon               3
Nauru                                   3
Central African Republic                3
Sao Tome and Principe                   4
Wallis and Futuna                       4
Faroe Islands                           4
East Timor                              4
Tonga                                   5
Korea                                   5
Bhutan                                  5
Saint Vincent and the Grenadines        5
Samoa                                   6
Gibraltar                               6
Anguilla                                6
Guinea-Bissau                           7
Western Sahara                          7
Marshall Islands                        7
Kiribati                                7
French Guiana                           7
Eritrea                                 8
Palau                                   9
                                    ...
Singapore                             412
Taiwan                                412
Iran                                  427
Sweden                                474
Switzerland                           520
Portugal                              541
Saudi Arabia                          560
Netherlands                           566
Malaysia                              567
South Korea                           589
Thailand                              604
Norway                                648
United Arab Emirates                  741
Greece                                814
Indonesia                             825
Turkey                                983
Mexico                               1053
Australia                            1092
Japan                                1299
Brazil                               1386
India                                1503
Italy                                1779
Russia                               1817
France                               1842
Canada                               1844
Germany                              2337
Spain                                2533
United Kingdom                       2635
China                                8146
United States                       13173
Name: destination_country, Length: 225, dtype: int64

## Save table in CSV

In [21]:
import pandas as pd
import sqlite3

conn, cursor = create_connect_database("flights.db")

query = """SELECT * FROM airports;"""

df = pd.read_sql_query(query, conn)
df.head(5)

   index id                        name  ... offset dst              timezone
0      0  1                      Goroka  ...     10   U  Pacific/Port_Moresby
1      1  2                      Madang  ...     10   U  Pacific/Port_Moresby
2      2  3                 Mount Hagen  ...     10   U  Pacific/Port_Moresby
3      3  4                      Nadzab  ...     10   U  Pacific/Port_Moresby
4      4  5  Port Moresby Jacksons Intl  ...     10   U  Pacific/Port_Moresby

[5 rows x 13 columns]

In [0]:
df.to_csv("my.csv")